Autodesk.Revit.DB.BRepBuilder.SetEdgeHidden(Autodesk.Revit.DB.BRepBuilderGeometryId,System.Boolean)
Make BRepBuilder allow edges to be hidden.
Remarks:
Set the edge to be hidden.
edgeId:
Id of the edge
hidden:
True for hidden
Throws Autodesk.Revit.Exceptions.ArgumentException:
The supplied edge id doesn't correspond to an edge stored in this BRepBuilder object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2021.1

Autodesk.Revit.DB.BRepBuilder.SetFacePatternPlacement(Autodesk.Revit.DB.BRepBuilderGeometryId,Autodesk.Revit.DB.PatternPlacer,System.Boolean)
Sets pattern placement of material on a face.
faceId:
Id of the face to which material id will be added. faceId was returned by a call to AddFace().
pattern:
Pattern placer of material on the face.
background:
True to set the pattern placement for background of the face, otherwise foreground
Throws Autodesk.Revit.Exceptions.ArgumentException:
The supplied face id doesn't correspond to a face stored in this BRepBuilder object.
-or-
The input face doesn't have a material assigned with Autodesk.Revit.DB.BRepBuilder.SetFaceMaterialId(Autodesk.Revit.DB.BRepBuilderGeometryId,Autodesk.Revit.DB.ElementId).
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2016

Autodesk.Revit.DB.BRepBuilder.IsValidPersistentIdsMap(Autodesk.Revit.DB.BRepBuilderPersistentIds)
A validator function that makes sure that all BRepBuilderGeometryIds in the input map can be found in this BRepBuilder object.
brepPersistentIds:
The map that associates ExternalGeometryIds to BRepBuilderGeometryIds.
Returns:
True if all BRepBuilderGeometryIds in the input map can be found in this BRepBuilder object, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2016

Autodesk.Revit.DB.BRepBuilder.IsValidEdgeId(Autodesk.Revit.DB.BRepBuilderGeometryId)
A validator function that checks whether the edge id corresponds to an edge previously added to this BRepBuilder object.
edgeId:
Edge id to be validated.
Returns:
True if edgeId corresponds to an edge previously added to this BRepBuilder, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2016

Autodesk.Revit.DB.BRepBuilder.IsValidLoopId(Autodesk.Revit.DB.BRepBuilderGeometryId)
A validator function that checks whether the loop id corresponds to a loop previously added to this BRepBuilder object.
loopId:
Loop id to be validated.
Returns:
True if loopId corresponds to a loop previously added to this BRepBuilder, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2016

Autodesk.Revit.DB.BRepBuilder.IsValidFaceId(Autodesk.Revit.DB.BRepBuilderGeometryId)
A validator function that checks whether the face id corresponds to a face previously added to this BRepBuilder object.
faceId:
Face id to be validated.
Returns:
True if faceId corresponds to a face previously added to this BRepBuilder, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2016

Autodesk.Revit.DB.BRepBuilder.IsPermittedSurfaceType(Autodesk.Revit.DB.Surface)
A validator function that checks whether the surface object is of type supported as face surface by BRepBuilder.
surface:
Surface object intended to be used as a face surface.
Returns:
True if surface of this type may be used as a face surface, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2016

Autodesk.Revit.DB.BRepBuilder.GetResult(Autodesk.Revit.DB.ExternalGeometryId,Autodesk.Revit.DB.BRepBuilderPersistentIds)
Get the Geometry object built by this BRepBuilder. This will clear the built Geometry stored in the BRepBuilder.
This function will throw if this BRepBuilder hasn't completed building the b-rep. Use IsResultAvailable() to verify that this BRepBuilder contains a valid result.
externalId:
The external Id of the Geometry object built by this BRepBuilder.
brepPersistentIds:
An object storing the relationship between ExternalGeometryIds and BRepBuilderGeometryIds.
Returns:
The Geometry object built by this BRepBuilder.
Throws Autodesk.Revit.Exceptions.ArgumentException:
At least one BRepBuilderGeometryId in the supplied BRepBuilderPersistentIds map could not be found in this BRepBuilder object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This BRepBuilder object hasn't completed building data or was unsuccessful building it. Built Geometry is unavailable.
In order to access the built Geometry, Finish() must be called first. That will set the state to completed.
Since:
2022

Autodesk.Revit.DB.BRepBuilder.GetResult
Get the Geometry object built by this BRepBuilder. This will clear the built Geometry stored in the BRepBuilder.
This function will throw if this BRepBuilder hasn't completed building the b-rep. Use IsResultAvailable() to verify that this BRepBuilder contains a valid result.
Returns:
The Geometry object built by this BRepBuilder.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This BRepBuilder object hasn't completed building data or was unsuccessful building it. Built Geometry is unavailable.
In order to access the built Geometry, Finish() must be called first. That will set the state to completed.
Since:
2016

Autodesk.Revit.DB.BRepBuilder.AddCoEdge(Autodesk.Revit.DB.BRepBuilderGeometryId,Autodesk.Revit.DB.BRepBuilderGeometryId,System.Boolean)
Add a co-edge associated to a previously added edge. A co-edge represents the use of an edge on one
of the edge's faces. BrepBuilder allows at most two faces per edge, hence at most two co-edges per edge,
and the co-edges must have opposite bCoEdgeIsReversed flags. The co-edges in a loop must be added in the
order in which they occur in loop (i.e., in their topological order).
loopId:
Id of the loop containing the new co-edge.
edgeId:
Id of the co-edge's edge, previously created by a call to addEdge().
bCoEdgeIsReversed:
True if the co-edge's topological direction in its face is opposite to the edge's parametric direction, false otherwise.
The topological directions of the co-edges in a loop must be consistent with the direction in which the loop co-edges
appear in the loop, and the loop orientations so defined must follow the convention that outer loops are oriented
counter-clockwise and inner loops are oriented clockwise, with respect to the face's orientation.
Returns:
Id of the edge, to be used in calls to other BRepBuilder methods such as AddCoEdge().
Throws Autodesk.Revit.Exceptions.ArgumentException:
The supplied loop id doesn't correspond to a loop stored in this BRepBuilder object.
-or-
The supplied edge id doesn't correspond to an edge stored in this BRepBuilder object.
-or-
FinishLoop() has already been called on loopId.
-or-
The edge already has two coedges associated to it.
-or-
Inconsistent use of the edge by co-edges is detected: both co-edges have the same bCoedgeIsReversed parameter.
-or-
The edge has already been added to this face.
-or-
There is a gap between this co-edge and the previous co-edge in the loop.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This BRepBuilder object isn't accepting new data, either because it has already been used to build geometry, or because of an error.
Consult the State property of the BRepBuilder object for more details.
Since:
2016

Autodesk.Revit.DB.BRepBuilder.AddEdge(Autodesk.Revit.DB.BRepBuilderEdgeGeometry)
Add a new edge to the geometry being built. The BRepBuilder uses edges only to store edge geometry and to track
pairs of co-edges that share an edge.
edgeGeom:
Information specifying the edge's geometry.
Returns:
Id of the edge, to be used in calls to other BRepBuilder methods such as AddCoEdge().
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input edge geometry was invalid.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This BRepBuilder object isn't accepting new data, either because it has already been used to build geometry, or because of an error.
Consult the State property of the BRepBuilder object for more details.
Since:
2016

Autodesk.Revit.DB.BRepBuilder.FinishLoop(Autodesk.Revit.DB.BRepBuilderGeometryId)
Indicates that the caller has finished defining the given loop.
Remarks:
No functions that modify the given loop's definition should be called after calling this function (e.g., Autodesk.Revit.DB.BRepBuilder.AddCoEdge(Autodesk.Revit.DB.BRepBuilderGeometryId,Autodesk.Revit.DB.BRepBuilderGeometryId,System.Boolean)).
The BRepBuilder may take the opportunity to validate some of the loop's data and report any problems it finds.
loopId:
Id of the loop.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The supplied loop id doesn't correspond to a loop stored in this BRepBuilder object.
-or-
FinishLoop() has already been called on loopId.
-or-
The edge loop has fewer than two co-edges.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2016

Autodesk.Revit.DB.BRepBuilder.AddLoop(Autodesk.Revit.DB.BRepBuilderGeometryId)
Creates an empty loop in a given face of the geometry being built. Other BRepBuilder methods are used to add co-edges to the loop.
faceId:
Id of the face to which the loop should be added. faceId was returned by a call to AddFace().
Returns:
An id that can be used to identify the loop while the BRepBuilder is actively building geometry (e.g., to add co-edges to the loop).
Throws Autodesk.Revit.Exceptions.ArgumentException:
The supplied face id doesn't correspond to a face stored in this BRepBuilder object.
-or-
FinishFace() has already been called on faceId.
-or-
Please finish the previous loop by calling FinishLoop() before adding a new one.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This BRepBuilder object isn't accepting new data, either because it has already been used to build geometry, or because of an error.
Consult the State property of the BRepBuilder object for more details.
Since:
2016

Autodesk.Revit.DB.BRepBuilder.SetFaceMaterialId(Autodesk.Revit.DB.BRepBuilderGeometryId,Autodesk.Revit.DB.ElementId)
Sets material id to a face.
faceId:
Id of the face to which material id will be added. faceId was returned by a call to AddFace().
materialId:
The material id associated with the face, or invalidElementId if none.
It is not verified that materialId corresponds to a valid Material element.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The supplied face id doesn't correspond to a face stored in this BRepBuilder object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This BRepBuilder object isn't accepting new data, either because it has already been used to build geometry, or because of an error.
Consult the State property of the BRepBuilder object for more details.
Since:
2016

Autodesk.Revit.DB.BRepBuilder.FinishFace(Autodesk.Revit.DB.BRepBuilderGeometryId)
Indicates that the caller has finished defining the given face.
Remarks:
No functions that modify the given face's definition should be called after calling this function (e.g., Autodesk.Revit.DB.BRepBuilder.AddLoop(Autodesk.Revit.DB.BRepBuilderGeometryId), Autodesk.Revit.DB.BRepBuilder.SetFaceMaterialId(Autodesk.Revit.DB.BRepBuilderGeometryId,Autodesk.Revit.DB.ElementId)).
The BRepBuilder may take the opportunity to validate some of the face's data and report any problems it finds.
faceId:
Id of the face.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The supplied face id doesn't correspond to a face stored in this BRepBuilder object.
-or-
FinishFace() has already been called on faceId.
-or-
The face has no edge loops.
-or-
FinishLoop() must be called on all the edge loops of faceId.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2016

Autodesk.Revit.DB.BRepBuilder.AddFace(Autodesk.Revit.DB.BRepBuilderSurfaceGeometry,System.Boolean)
Creates an empty face in the geometry being built. Other BRepBuilder methods are used to add loops to the face.
surfaceGeom:
The face's support surface.
bFaceIsReversed:
True if the face's orientation is opposite to that of the surface, false if the orientations agree.
The faces of each shell must be consistently oriented. For a solid (BRepType == Solid), the oriented face normals
must point out of the solid; for a void (BRepType == Void), the face normals must point into the void.
See the description of the bCoEdgeIsReversed input for AddCoEdge() for a discussion of the loop and co-edge orientation conventions
to use with the BRepBuilder.
Returns:
An id that can be used to identify the face while the BRepBuilder is actively building geometry (e.g., to add a loop to a face).
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This BRepBuilder object isn't accepting new data, either because it has already been used to build geometry, or because of an error.
Consult the State property of the BRepBuilder object for more details.
Since:
2016